---

# Importing libraries/packages for project

In [1]:
import pandas as pd
import numpy as np
from pandas.api.types import CategoricalDtype

# Importing data

In [2]:
# https://www.kaggle.com/datasets/sanjay3454chauhan/personal-expense-data
data = '../data collection/PersonalExpenses.csv'
dataset = pd.read_csv(data)

# Exploratory Data Analysis

## Dataset Preview

In [3]:
dataset.head()

       Date     Item  Amount Category   Time        day
0  1/3/2023     chai       7    alone   7:00  Wednesday
1  1/3/2023     chai      20   friend  10:00  Wednesday
2  1/3/2023    juice      15   friend  13:00  Wednesday
3  1/3/2023  rikshow      12    alone  14:00  Wednesday
4  1/3/2023   coffee      12    alone  15:00  Wednesday

## Dataset Information

In [4]:
dataset.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 145 entries, 0 to 144
Data columns (total 6 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Date      145 non-null    object
 1   Item      145 non-null    object
 2   Amount    145 non-null    int64
 3   Category  144 non-null    object
 4   Time      145 non-null    object
 5   day       145 non-null    object
dtypes: int64(1), object(5)
memory usage: 6.9+ KB

The dataset contains only two variable types: int and object (string).

## Descriptive Statistics

In [5]:
dataset.describe().T

        count       mean        std  min   25%   50%   75%    max
Amount  145.0  31.786207  56.389541  5.0  12.0  17.0  30.0  500.0

## Data Cleaning

Steps:
- Check for duplicate values
- Check for missing values
- Data Consistency Validation
- Transform & Convert Types

In [6]:
# Display all the columns in the dataset
dataset.columns

Index(['Date', 'Item', 'Amount', 'Category', 'Time', 'day'], dtype='object')

### Check for Duplicate values

In [7]:
dataset.duplicated().value_counts()

False    145
Name: count, dtype: int64

### Check for Null/Missing Values

In [8]:
dataset.isna().sum()

Date        0
Item        0
Amount      0
Category    1
Time        0
day         0
dtype: int64

Replace nan with value "unknown"

In [9]:
dataset['Category'].unique()

array(['alone', 'friend', nan], dtype=object)

In [10]:
dataset['Category'] = dataset['Category'].fillna("unknown")

In [11]:
dataset.isna().sum()

Date        0
Item        0
Amount      0
Category    0
Time        0
day         0
dtype: int64

In [12]:
dataset['Category'].unique()

array(['alone', 'friend', 'unknown'], dtype=object)

### Data Consistency Validation

One of the time values was found to be incorrectly formatted, and since there is no reliable way to correct it, the corresponding row will be deleted.

In [13]:
# dataset['Time'].unique
rows_to_drop = dataset[~dataset['Time'].str.contains(":", na=False)].index
dataset = dataset.drop(rows_to_drop)

### Data type conversions

In [14]:
#Before
dataset['Date'].dtype

dtype('O')

In [15]:
#Date is Day/Month/Year
dataset['Date'].head(-5)

0       1/3/2023
1       1/3/2023
2       1/3/2023
3       1/3/2023
4       1/3/2023
         ...
135    29/3/2023
136    29/3/2023
137    29/3/2023
138    30/3/2023
139    30/3/2023
Name: Date, Length: 139, dtype: object

In [16]:
# Convert the object column to datetime
dataset['Date'] = pd.to_datetime(dataset['Date'], format='%d/%m/%Y')

In [17]:
#After applying conversion
dataset.info()

<class 'pandas.core.frame.DataFrame'>
Index: 144 entries, 0 to 144
Data columns (total 6 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Date      144 non-null    datetime64[ns]
 1   Item      144 non-null    object
 2   Amount    144 non-null    int64
 3   Category  144 non-null    object
 4   Time      144 non-null    object
 5   day       144 non-null    object
dtypes: datetime64[ns](1), int64(1), object(4)
memory usage: 7.9+ KB

In [ ]:
dataset.to_csv("../data collection/new_PersonalExpenses.csv", index=False)